In [40]:
import pandas as pd
import numpy as np

In [41]:
data = pd.read_excel('C:/Users/swapn/OneDrive/Documents/Henry Harvin Internship/combined.xlsx')

In [42]:
data.head()

        Date Councellor Name Course Name  Fees Received  Fees Total
0 2020-04-01              SK        CADM         5000.0      5000.0
1 2020-04-01              SK        CDCW         7500.0      7500.0
2 2020-04-01              SK        CDCW         9500.0      9500.0
3 2020-04-01              SK        CDCW         9500.0      9500.0
4 2020-04-01              SK        CDCW         9000.0      9000.0

In [43]:
data.isnull().sum()

Date               0
Councellor Name    0
Course Name        0
Fees Received      1
Fees Total         7
dtype: int64

In [44]:
data['Councellor Name'].value_counts()

Manish              428
Pooja               322
IJ                  314
MM                  314
SS                  310
                   ...
]                     1
Jyoti                 1
Abhishek Chauhan      1
779962                1
Vidushi               1
Name: Councellor Name, Length: 83, dtype: int64

In [45]:
data = data.replace(to_replace = "Abhishek C", value = "Abhishek Chauhan")

In [46]:
data = data.replace(to_replace = "APOORVA", value = "Apoorva")

In [47]:
data = data.replace(to_replace = "KIM", value = "Kim")

In [48]:
data = data.replace(to_replace = "Namarta", value = "Namrata")

In [49]:
data = data.replace(to_replace = "akansha", value = "Akansha")

In [50]:
data = data.replace(to_replace = "vipin", value = "Vipin")

In [51]:
data = data.replace(to_replace = "MANISH", value = "Manish")

In [52]:
data = data.replace(to_replace = "sahiba", value = "Sahiba")

In [53]:
data = data.replace(to_replace = "shanoon", value = "Shanoon")

In [54]:
data.to_excel('combinedEmp.xlsx')